GREETING_MSG = '''
Привет. Прежде чем отправиться в увлекательное путешествие, нам надо определиться с целью, зачем нам это все?
Зачем тебе каждый день возвращаться ко мне? Зачем читать рекомендации о том, как с помощью полезных привычек
делать свою жизнь другой? Какой другой, я определить не смогу, только ты сможешь определить как с помощью
привычек ты хочешь изменить свою жизнь. И для этого нам с тобой надо поставить цель! Такую, которая тебя будет
вдохновлять и мотивировать. Если тебе сложно определиться с целью, можно почитать статьи как их формировать
'''

USER_GOAL_MSG = '''
Пример...
1. Название цели:
2. Срок:
3. Зачем мне это:
'''