DAY_0_INTRO_MSG = '''
0 ДЕНЬ. Моя цель
'''

DAY_0_MSG_1 = '''
Привет. Прежде чем отправиться в увлекательное путешествие, нам надо определиться с целью, зачем нам это все?
Зачем тебе каждый день возвращаться ко мне? Зачем читать рекомендации о том, как с помощью полезных привычек делать свою жизнь другой? Какой другой, я определить не смогу, только ты сможешь определить как с помощью
привычек ты хочешь изменить свою жизнь. И для этого нам с тобой надо поставить цель! Такую, которая тебя будет вдохновлять и мотивировать. Если тебе сложно определиться с целью, можно почитать статьи как их формировать
[Ссылка на статью]
[Ссылка на статью]
'''

USER_GOAL_MSG_1 = '''
1. Опиши мне свою цель, в будующем ты сможешь ее изменить или удалить
'''

USER_GOAL_MSG_2 = '''
2. Теперь определи срок, за который ты собираешь достичь своей цели
'''

USER_GOAL_MSG_3 = '''
3. И наконец ответь себе на вопрос "А зачем мне эта цель?"
'''

DAY_0_MSG_2 = '''
Теперь давай определим во сколько тебе удобно получать сообщения от меня?
Выбери свой вариант из меню
'''

DAY_0_MSG_3 = '''
Отлично, мы с тобой определили цель, зачем она тебе и в какие сроки ты хочешь ее достичь. До завтра!
'''

DAY_1_INTRO_MSG = '''
1 ДЕНЬ. Мои текущие привычки
'''

DAY_1_MSG_1 = '''
У всех у нас есть привычки, большинство из них уже работают на подсознательном уровне. 
Мы моем руки, чистим зубы практически на автомате. Понимая что это необходимо и полезно. 
Так же есть и не очень полезные привычки, которые могут оказаться безобидными. 
Купить по дороге на работу кофе, которая срабатывает когда вы проходите мимо кофейни, а в те дни когда вы идете другим путем - вы забываете про кофе и не покупаете его. Это триггер привычки. 
Их надо уметь выявлять и фиксировать. Большинство регулярных действий в течении дня/недели являются нашими привычками. Твоя задача отправлять мне все привычки, и возможные триггеры которые повлияли на запуск привычки.
'''

USER_HABBIT_MSG_1 = '''
Опиши свою привычку:
'''

USER_HABBIT_MSG_2 = '''
Попробуй найти триггер, после которого ты совершаешь свою привычку
'''

USER_HABBIT_MSG_3 = '''
Как считаешь, она полезная?
'''

DAY_1_MSG_2 = '''
Кстати, ты помнишь какая у нас цель? {user_goal} до {goal_date} достигнуть тебе ее надо по следующей причине: {goal_reason}
Есали вдруг, у тебя что-то изменилось по цели (и это нормально, надо держать цель которая тянет к себе как маяк,
когда море бушует и помочь может только Маяк - Цель!)
'''

DAY_2_INTRO_MSG = '''
2 ДЕНЬ. Мои установки
'''

DAY_2_MSG_1 = '''
Каждый день в голове пролетают множество мыслей. И мысли бывают негативные и позитивные. Негативные мысли появляются в голове проще и быстрее.
Так работает подсознание, оно нас защищает от рисков и опасностей. И нам от этого легче и проще ничего не делать. Но в современном мире множество из этих рисков и опасностей не оправданы. И мы в течении дня тратим много мысленной энергии на страхи и опасности. На самом деле рисков и опасностей в современном мире становиться больше как раз от "ничегонеделанния". 
Как вы понимаете, нам выгоднее чтобы у нас было больше позитивных мыслей. Но как это сделать, если в голове сами возникают негативные мысли, страхи? Через позитивные установки! Вы сами в течении дня крутите у себя мысли, которые идут вам на пользу, добавляют уверенности, осознанности, позитива. 
На текущий момент у вас уже работают определенные установки, которые вам мешают. 
Допустим: 
    Не хочу рано вставать, успею быстро доехать на такси. 
    Не хочу мыть посуду, я устал за сегодня. 
    Я устал, пойду телек посмотрю. 
    Мне что, больше всех надо?
    Так, а я что мог тут поделать? 
Как видите, установки в целом очень связаны с привычками и формируют их. Поэтому важно отслеживать какие установки работают у вас, выявлять их, и далее заменять их на правильные для вашей успешной жизни установки! 
Твоя задача в течении дня выявлять установки и фиксировать их. Негативные и позитивные. Те, которые помогают тебе достичь цели, и те которые мешают
'''

USER_ATTITUDE_MSG_1 = '''
Название, например:
Добавить больше сахара в чай, так как это повышает продуктивность.
'''

USER_ATTITUDE_MSG_2 = '''
Как считаешь, она позитивная?
'''

DAY_2_MSG_2 = '''
Сегодня мы записали одну твою установку. Если захочешь добавить еще установку или изменить уже записанные - воспользуйся меню Настройки -> Установки. На сегодня все, увидимся завтра!
'''

DAY_3_INTRO_MSG = '''
3 ДЕНЬ. Мои характеристики
'''

DAY_3_MSG_1 = '''
Привет, мы уже 3й день с тобой. И не забывай про нашу цель {user_goal}, и зачем: {goal_reason}. 
Вчера ты отправил 3 установки! Молодец! А еще за 2 дня ты выявил и отправил 7 своих привычек! Это очень круто. 
Я очень надеюсь что мы дойдем этот путь до конца. По статистике не более 20% проходят все занятия до конца и забрасывают. Это кстати тоже плохая привычка и установки, которые и отличают успешных людей добивающихся своих целей от остальных. Я тебе буду помогать изо всех сил войти в список этих успешных людей, тем более что у нас есть методика, а ты человек и у тебя есть все возможности! 
Давай вернемся к тому, чтобы дальше определить, что же мешало достигать поставленных задач в прошлом. То, как ты себя сам называешь, когда тебе очень хорошо или плохо - это характеристики. Если ты называешь себя "вот я тупой", "вот я тормоз" и т.д., как ты понимаешь это не помогает продвигаться к цели эффективно. 
Давай мы попробуем выявить твои характеристики, как ты себя называешь? Кто ты глубоко внутри, когда никто тебя не слышит и не видит? маленький ребенок? беззащитное существо? Пофигист? Постарайся поймать свой внутренний настрой и зафиксировать эти арактеристики.
'''

USER_CHARACTERISTIC_1 = '''
Название:
'''

USER_CHARACTERISTIC_2 = '''
Как считаешь, она позитивная?
'''

DAY_3_MSG_2 = '''
Супер! Следи за собой в течении дня. Я буду напоминать тебе о том, чтобы ты не забывал отправлять свои характеристики, установки и привычки.
'''

DAY_4_INTRO_MSG = '''
4 ДЕНЬ. Мои новые характеристики
'''

DAY_4_MSG_1 = '''
Привет. Кстати, мы уже довольно близко знакомы. Позволь узнать о тебе чуть больше.
'''

DAY_4_MSG_2 = '''
Как мне к тебе обращаться?
'''

DAY_4_MSG_3 = '''
Отлично {main_characteristic}. Мне это было необходимо, чтобы дальше предложить тебе выбрать характеристики, которые будут давать тебе силы и уверенности в достижении поставленных целей.
'''

DAY_4_MSG_4 = '''
И не забывай, следи за своими мыслями и фиксируй что происходит в твоей голове. Ты берешь под контроль собственную жизнь, и в первую очередь нужно взять под контроль свои мысли. Ты согласен? :)
'''

DAY_4_MSG_5 = '''
Класс. У тебя не было другого выбора :) Рекомендую добавить эту характеристику в список, при этом пометить ее как позитивная. Наша с тобой задача в итоге увеличить список позитивных характеристик и сократить до минимума негативные.
'''

DAY_5_INTRO_MSG = '''
5 ДЕНЬ. Мои новые установки
'''

DAY_5_MSG_1 = '''
Привет {main_characteristic}! :) Да, я помню у тебя есть цель. Но я рекомендую поставить несколько целей, которые помогут тебе формировать новые полезные привычки. Выбери какую сферу тебе хотелось бы прокачать в первую очередь:
'''

DAY_5_MSG_2 = '''
Отлично. Мне это необходимо было, чтобы дальше предложить тебе выбрать установки, которые тебе необходимо повторять каждый день по 100 раз, чтобы заменить бесконтрольный поток бесполезных мыслей, на нужные и полезные мысли которые помогут достичь целей!
'''

DAY_5_MSG_3 = '''
Супер! Давай я тебе буду напоминать о том, чтобы проговаривать эту установку?
'''

DAY_5_MSG_4 = '''
Класс. Рекомендую добавить эту установку в список, при этом пометить ее как позитивная. Наша с тобой задача в итоге увеличить список позитивных установок и сократить до минимума негативных.
'''