MSGS_SHEDULER = {
    'Утром': ''
}

DAY_0_MSG_1 = '''
Привет. Прежде чем отправиться в увлекательное путешествие, нам надо определиться с целью, зачем нам это все?
Зачем тебе каждый день возвращаться ко мне? Зачем читать рекомендации о том, как с помощью полезных привычек делать свою жизнь другой? Какой другой, я определить не смогу, только ты сможешь определить как с помощью
привычек ты хочешь изменить свою жизнь. И для этого нам с тобой надо поставить цель! Такую, которая тебя будет вдохновлять и мотивировать. Если тебе сложно определиться с целью, можно почитать статьи как их формировать
'''

USER_GOAL_MSG_1 = '''
1. Опиши мне свою цель, в будующем ты сможешь ее изменить или удалить
'''

USER_GOAL_MSG_2 = '''
2. Теперь определи срок, за который ты собираешь достичь своей цели
'''

USER_GOAL_MSG_3 = '''
3. И наконец ответь себе на вопрос "А зачем мне эта цель?"
'''

DAY_0_MSG_2 = '''
Теперь давай определим во сколько тебе удобно получать сообщения от меня?
Выбери свой вариант из меню
'''

DAY_1_MSG_1 = '''
У всех у нас есть привычки, большинство из них уже работают на подсознательном уровне. 
Мы моем руки, чистим зубы практически на автомате. Понимая что это необходимо и полезно. 
Так же есть и не очень полезные привычки, которые могут оказаться безобидными. 
Купить по дороге на работу кофе, которая срабатывает когда вы проходите мимо кофейни, а в те дни когда вы идете другим путем - вы забываете про кофе и не покупаете его. Это триггер привычки. 
Их надо уметь выявлять и фиксировать. Большинство регулярных действий в течении дня/недели являются нашими привычками. Твоя задача отправлять мне все привычки, и возможные триггеры которые повлияли на запуск привычки.
'''

DAY_1_MSG_2 = '''
Кстати, ты помнишь какая у нас цель? "цель" и "дата" достигнуть тебе ее надо по следующей причине: "ответ зачем..."
Есали вдруг, у тебя что-то изменилось по цели (и это нормально, надо держать цель которая тянет к себе как маяк,
когда море бушует и помочь может только Маяк - Цель!)
'''