"""
Вызываем с помощью CronTab для рассылки сообщений пользователям 3 раза в день
"""


def check_current_timeinterval():
    """
    Определить текущий временной промежуток
    :return:
    """
    pass


def parse_preferences():
    """
    Парсим настройки пользователей, для рассылки по текущему временному промежутку
    :return:
    """
    pass


def mailing_list():
    """
    Разослать сообщения пользователям в зависимости от текущего временного промежутка
    :return:
    """
    pass


if __name__ == '__main__':
    pass